{"pageProps":{"person":{"__typename":"Staff","title":"Krista","slug":"krista","featuredImage":{"__typename":"NodeWithFeaturedImageToMediaItemConnectionEdge","node":{"__typename":"MediaItem","sourceUrl":"https://wordpress-74434-5742908.cloudwaysapps.com/cms/wp-content/uploads/2025/08/krista.png"}},"staffFields":{"__typename":"Staff_Stafffields","stafftitle":"NP Injector","staffbookingurl":"https://reluxe.click/book","stafffunfact":"She saved a guy on a flight.","videoIntro":null,"staffBio":"<p>Krista is a Carmel local and graduated from CHS in 2008. She is now a Master’s prepared Nurse Practitioner with expertise and passion for aesthetics. She completed her Bachelor of Science in Nursing with a minor in Nutrition while playing 4 years of collegiate volleyball at the University of Southern Indiana. Krista then began her nursing career in the Cardiac Intensive Care Unit, working for 7 years while completing her Master’s degree. After passing her NP certification, she worked inpatient for 4 years, specializing in cardiology-electrophysiology for 2 years and, most recently, pulmonary critical care.</p>\n<p>Krista began her aesthetic career in early 2023 as a nurse practitioner injector after completing a certification course with hands-on experience at the highly accredited National Laser Institute in Scottsdale, Arizona. She then started her own successful concierge injectable business, Shea Aesthetics. She continued to work fulltime as a critical care nurse practitioner while growing her business, client list and gaining experience. In the winter of 2023, she followed her aesthetic passion and pursued her dream of working full-time at Reluxe Med Spa. Continuing education is very important to Krista. She loves exploring new products and learning new techniques to bring the most up-to-date treatment options to the area.</p>\n<p>Krista is happy to be living where she grew up. She is married to her husband, Jordan, and has two children. Her community is important to her. When not at work, she enjoys spending time with her family, traveling, and golfing. She loves going to sporting events and concerts.</p>\n","transparentbg":{"__typename":"MediaItem","id":"cG9zdDoxNDY=","altText":"","mediaItemUrl":"https://wordpress-74434-5742908.cloudwaysapps.com/cms/wp-content/uploads/2025/08/krista-float.png","sourceUrl":"https://wordpress-74434-5742908.cloudwaysapps.com/cms/wp-content/uploads/2025/08/krista-float.png"},"specialties":[{"__typename":"Staff_Stafffields_specialties","specialty":"Facial Balancing"},{"__typename":"Staff_Stafffields_specialties","specialty":"Tasteful Tox"}],"credentials":[{"__typename":"Staff_Stafffields_credentials","credentialItem":"Nurse Practicioner"}],"availability":[{"__typename":"Staff_Stafffields_availability","day":"Monday","hours":"9:00 AM – 5:00 PM"},{"__typename":"Staff_Stafffields_availability","day":"Tuesday","hours":"9:00 AM – 5:00 PM"},{"__typename":"Staff_Stafffields_availability","day":"Thursday","hours":"9:00 AM – 5:00 PM"},{"__typename":"Staff_Stafffields_availability","day":"Friday","hours":"9:00 AM – 5:00 PM"}],"socialProfiles":[{"__typename":"Staff_Stafffields_socialProfiles","label":"Instagram","url":"https://instagram.com/injector.krista"}]}}},"__N_SSG":true}